---
type: FilterGlobalParameterAssociationRule
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# FilterGlobalParameterAssociationRule

`Autodesk.Revit.DB.FilterGlobalParameterAssociationRule` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FilterGlobalParameterAssociationRule | 2017 | `public FilterGlobalParameterAssociationRule ( FilterableValueProvider valueProvider , FilterNumericRuleEvaluator evaluator , ElementId ruleValue )` |
| Property | RuleValue | 2017 | `public ElementId RuleValue { get ; set ; }` |